
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 6 to change, 1 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0]
  * module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0]
* Update
  * azapi_resource.add_local_user
  * module.metric-alert.azurerm_resource_group_template_deployment.metric-alert
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Delete
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be updated in-place
  ~ resource "azapi_resource" "add_local_user" {
      ~ body                      = (sensitive value)
        id                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/localUsers/sscsaat"
        name                      = (sensitive value)
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (6 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_activity_log_alert" "main" {
      - description         = "Monitors for application insight reaching it's daily cap." -> null
      - enabled             = true -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - sscs-aat" -> null
      - location            = "global" -> null
      - name                = "Application Insights daily cap reached - sscs-aat" -> null
      - resource_group_name = "sscs-aat" -> null
      - scopes              = [
          - "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/components/sscs-aat",
        ] -> null
      - tags                = {
          - "Team Contact"        = "#sscs"
          - "Team Name"           = "SSCS Team"
          - "application"         = "social-service-child-support"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#sscs-tech"
          - "environment"         = "staging"
          - "managedBy"           = "SSCS"
        } -> null

      - action {
          - action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts" -> null
          - webhook_properties = {
              - "from"           = "terraform"
              - "slackChannelId" = "C3CNBP5A6"
            } -> null
        }

      - criteria {
          - category           = "Administrative" -> null
          - level              = "Warning" -> null
          - levels             = [] -> null
          - operation_name     = "Microsoft.Insights/Components/DailyCapReached/Action" -> null
          - resource_groups    = [] -> null
          - resource_id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/components/sscs-aat" -> null
          - resource_ids       = [] -> null
          - resource_providers = [] -> null
          - resource_types     = [] -> null
          - statuses           = [] -> null
          - sub_statuses       = [] -> null
        }
    }

  # module.application_insights.azurerm_monitor_scheduled_query_rules_alert_v2.main[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "main" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Monitors for application insight reaching it's daily cap."
      + enabled                                = true
      + evaluation_frequency                   = "P1D"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "uksouth"
      + name                                   = "Application Insights daily cap reached - sscs-aat"
      + resource_group_name                    = "sscs-aat"
      + scopes                                 = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod",
        ]
      + severity                               = 4
      + tags                                   = {
          + "Team Contact"        = "#sscs"
          + "Team Name"           = "SSCS Team"
          + "application"         = "social-service-child-support"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#sscs-tech"
          + "environment"         = "staging"
          + "managedBy"           = "SSCS"
        }
      + window_duration                        = "P1D"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups     = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts",
            ]
          + custom_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C3CNBP5A6"
            }
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureActivity 
                  | where ResourceId == "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/components/sscs-aat"
                  | where OperationNameValue == "Microsoft.Insights/Components/DailyCapReached/Action"
                  | where Level == "Warning"
                  | where Category == "Administrative"
                  | where TimeGenerated > ago(1d)
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.application_insights.null_resource.fix_scheduled_query_rules_alert_v2[0] will be created
  + resource "null_resource" "fix_scheduled_query_rules_alert_v2" {
      + id       = (known after apply)
      + triggers = {
          + "alert_id" = (known after apply)
        }
    }

  # module.metric-alert.data.template_file.actiongrouptemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "actiongrouptemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupsExternalId    = {
                      + type = "string"
                    }
                  + alertDescription          = {
                      + type = "string"
                    }
                  + alertEvaluationFrequency  = {
                      + type = "string"
                    }
                  + alertQuery                = {
                      + type = "string"
                    }
                  + alertSeverity             = {
                      + type = "string"
                    }
                  + alertWindowSize           = {
                      + type = "string"
                    }
                  + commonTags                = {
                      + type = "string"
                    }
                  + location                  = {
                      + type = "string"
                    }
                  + scheduledQueryRulesName   = {
                      + type = "string"
                    }
                  + storageAccountsExternalId = {
                      + type = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2022-06-15"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('scheduledQueryRulesName')]"
                      + properties = {
                          + actions                = {
                              + actionGroups     = [
                                  + "[parameters('actionGroupsExternalId')]",
                                ]
                              + actionProperties = {}
                              + customProperties = {}
                            }
                          + autoMitigate           = false
                          + criteria               = {
                              + allOf = [
                                  + {
                                      + dimensions      = []
                                      + failingPeriods  = {
                                          + minFailingPeriodsToAlert  = 1
                                          + numberOfEvaluationPeriods = 1
                                        }
                                      + operator        = "GreaterThan"
                                      + query           = "[parameters('alertQuery')]"
                                      + threshold       = 0
                                      + timeAggregation = "Count"
                                    },
                                ]
                            }
                          + description            = "[parameters('alertDescription')]"
                          + displayName            = "[parameters('scheduledQueryRulesName')]"
                          + enabled                = true
                          + evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          + overrideQueryTimeRange = "P2D"
                          + scopes                 = [
                              + "[parameters('storageAccountsExternalId')]",
                            ]
                          + severity               = "[parameters('alertSeverity')]"
                          + targetResourceTypes    = [
                              + "Microsoft.Storage/storageAccounts",
                            ]
                          + windowSize             = "[parameters('alertWindowSize')]"
                        }
                      + tags       = "[variables('tags')]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.metric-alert.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-email"
        name                = "sscs-fail-alert-sscssftp-email"
      ~ output_content      = jsonencode({}) -> (known after apply)
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                = "SSCSF_alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                = "SSCSF_slack"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert"
        name                = "sscs-fail-alert"
      ~ output_content      = jsonencode({}) -> (known after apply)
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "String"
                    }
                  - actionGroupRg            = {
                      - type = "String"
                    }
                  - alertDesc                = {
                      - type = "String"
                    }
                  - alertName                = {
                      - type = "String"
                    }
                  - appInsightsName          = {
                      - type = "String"
                    }
                  - appInsightsQuery         = {
                      - type = "String"
                    }
                  - commonTags               = {
                      - type = "String"
                    }
                  - customEmailSubject       = {
                      - type = "String"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - location                 = {
                      - type = "String"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "String"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - triggerThreshold         = {
                      - type = "String"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.sscs-sya-submit-fail-alert.data.template_file.metricalerttemplate will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "metricalerttemplate" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + actionGroupName          = {
                      + type = "string"
                    }
                  + actionGroupRg            = {
                      + type = "string"
                    }
                  + alertDesc                = {
                      + type = "string"
                    }
                  + alertName                = {
                      + type = "string"
                    }
                  + appInsightsName          = {
                      + type = "string"
                    }
                  + appInsightsQuery         = {
                      + type = "string"
                    }
                  + commonTags               = {
                      + type = "string"
                    }
                  + customEmailSubject       = {
                      + type = "string"
                    }
                  + frequencyInMinutes       = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + location                 = {
                      + type = "string"
                    }
                  + severityLevel            = {
                      + defaultValue = "3"
                      + type         = "string"
                    }
                  + timeWindowInMinutes      = {
                      + defaultValue = "5"
                      + type         = "string"
                    }
                  + triggerThreshold         = {
                      + type = "string"
                    }
                  + triggerThresholdOperator = {
                      + allowedValues = [
                          + "GreaterThan",
                          + "Equal",
                          + "LessThan",
                        ]
                      + defaultValue  = "GreaterThan"
                      + type          = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-09-01-preview"
                      + location   = "[parameters('location')]"
                      + name       = "[parameters('alertName')]"
                      + properties = {
                          + action      = {
                              + aznsAction   = {
                                  + actionGroup  = [
                                      + "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  + emailSubject = "[parameters('customEmailSubject')]"
                                }
                              + "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              + severity     = "[parameters('severityLevel')]"
                              + status       = "Active"
                              + trigger      = {
                                  + consecutiveBreach = 1
                                  + threshold         = "[parameters('triggerThreshold')]"
                                  + thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          + description = "[parameters('alertDesc')]"
                          + enabled     = "true"
                          + schedule    = {
                              + frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              + timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          + skuType     = "L1"
                          + source      = {
                              + dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              + query        = "[parameters('appInsightsQuery')]"
                              + queryType    = "ResultCount"
                            }
                        }
                      + tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      + type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              + variables      = {
                  + additionalTags = {
                      + "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  + tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        )
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-sya-submit-fail"
        name                = "sscs-sya-submit-fail"
      ~ output_content      = jsonencode({}) -> (known after apply)
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - "$schema"      = "https://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupName          = {
                      - type = "String"
                    }
                  - actionGroupRg            = {
                      - type = "String"
                    }
                  - alertDesc                = {
                      - type = "String"
                    }
                  - alertName                = {
                      - type = "String"
                    }
                  - appInsightsName          = {
                      - type = "String"
                    }
                  - appInsightsQuery         = {
                      - type = "String"
                    }
                  - commonTags               = {
                      - type = "String"
                    }
                  - customEmailSubject       = {
                      - type = "String"
                    }
                  - frequencyInMinutes       = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - location                 = {
                      - type = "String"
                    }
                  - severityLevel            = {
                      - defaultValue = "3"
                      - type         = "String"
                    }
                  - timeWindowInMinutes      = {
                      - defaultValue = "5"
                      - type         = "String"
                    }
                  - triggerThreshold         = {
                      - type = "String"
                    }
                  - triggerThresholdOperator = {
                      - allowedValues = [
                          - "GreaterThan",
                          - "Equal",
                          - "LessThan",
                        ]
                      - defaultValue  = "GreaterThan"
                      - type          = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-09-01-preview"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('alertName')]"
                      - properties = {
                          - action      = {
                              - aznsAction   = {
                                  - actionGroup  = [
                                      - "[resourceId(parameters('actionGroupRg'), 'microsoft.insights/actionGroups', parameters('actionGroupName'))]",
                                    ]
                                  - emailSubject = "[parameters('customEmailSubject')]"
                                }
                              - "odata.type" = "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                              - severity     = "[parameters('severityLevel')]"
                              - status       = "Active"
                              - trigger      = {
                                  - consecutiveBreach = 1
                                  - threshold         = "[parameters('triggerThreshold')]"
                                  - thresholdOperator = "[parameters('triggerThresholdOperator')]"
                                }
                            }
                          - description = "[parameters('alertDesc')]"
                          - enabled     = "true"
                          - schedule    = {
                              - frequencyInMinutes  = "[parameters('frequencyInMinutes')]"
                              - timeWindowInMinutes = "[parameters('timeWindowInMinutes')]"
                            }
                          - skuType     = "L1"
                          - source      = {
                              - dataSourceId = "[resourceId('microsoft.insights/components', parameters('appInsightsName'))]"
                              - query        = "[parameters('appInsightsQuery')]"
                              - queryType    = "ResultCount"
                            }
                        }
                      - tags       = "[union(variables('tags'), variables('additionalTags'))]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - additionalTags = {
                      - "[concat('hidden-link:', resourceId('microsoft.insights/components', parameters('appInsightsName')))]" = "Resource"
                    }
                  - tags           = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 6 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":178,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->